
#include "test.h"

U32 gauiTask1Stack[TASKSTACK];      /* 任务1的堆栈 */
U32 gauiTask2Stack[TASKSTACK];      /* 任务2的堆栈 */


/***********************************************************************************
函数功能: 主函数, C程序从此函数开始运行. 该函数创建系统任务并从非任务状态切换到任务
          状态运行.
入口参数: none.
返 回 值: none.
***********************************************************************************/
S32 main(void)
{
    /* 初始化硬件 */
    DEV_HardwareInit();

    /* 创建任务 */
    WLX_TaskInit(1, TEST_TestTask1, TEST_GetTaskInitSp(1));
    WLX_TaskInit(2, TEST_TestTask2, TEST_GetTaskInitSp(2));

    /* 开始任务调度 */
    WLX_TaskStart();

    return 0;
}

/***********************************************************************************
函数功能: 测试任务切换函数1, 向串口打印字符串.
入口参数: none.
返 回 值: none.
***********************************************************************************/
void TEST_TestTask1(void)
{
    while(1)
    {
        DEV_PutString((U8*)"\r\nTask1 is running!");

        DEV_DelayMs(1000);      /* 延迟1s */

        WLX_TaskSwitch();       /* 任务切换 */
    }
}

/***********************************************************************************
函数功能: 测试任务切换函数2, 向串口打印字符串.
入口参数: none.
返 回 值: none.
***********************************************************************************/
void TEST_TestTask2(void)
{
    while(1)
    {
        DEV_PutString((U8*)"\r\nTask2 is running!");

        DEV_DelayMs(2000);      /* 延迟2s */

        WLX_TaskSwitch();       /* 任务切换 */
    }
}

/***********************************************************************************
函数功能: 获取任务的初始化堆栈指针.
入口参数: ucTask: 运行的任务, 1或者2.
返 回 值: 堆栈的高地址.
***********************************************************************************/
U32* TEST_GetTaskInitSp(U8 ucTask)
{
    if(1 == ucTask)
    {
        return (gauiTask1Stack + TASKSTACK);
    }
    else //if(2 == ucTask)
    {
        return (gauiTask2Stack + TASKSTACK);
    }
}

