
#include "device.h"


/***********************************************************************************
函数功能: 初始化硬件.
入口参数: none.
返 回 值: none.
***********************************************************************************/
void DEV_HardwareInit(void)
{
    /* 设置GPIO管脚模式 */
    DEV_SetGpioMode();

    /* 初始化串口 */
    DEV_UartInit();
}

/***********************************************************************************
函数功能: 初始化串口.
入口参数: none.
返 回 值: none.
***********************************************************************************/
void DEV_UartInit(void)
{
    COMDIV2 = 0;
    COMIEN0 = 0;        /* 关闭串口收发中断 */

    /* 允许访问COMDIV0和COMDIV1寄存器 */
    COMCON0 = 0x83;
    COMDIV0 = 0x88;     /* 9600波特率 */
    COMDIV1 = 0;

    /* 允许访问COMRX和COMTX, 1开始位1停止位8bits */
    COMCON0 = 3;
}

/***********************************************************************************
函数功能: 向串口发送一个字符.
入口参数: ucChar: 输出的字符.
返 回 值: none.
***********************************************************************************/
void DEV_PutChar(U8 ucChar)
{
    /* 串口发送忙状态 */
    while(0x0 == (COMSTA0 & 0x40))
    {
        ;
    }

    COMTX = ucChar;
}

/***********************************************************************************
函数功能: 向串口发送字符串, 采用软件查询方式.
入口参数: pucChar: 输出的字符串指针.
返 回 值: none.
***********************************************************************************/
void DEV_PutString(U8* pucChar)
{
    U8 i;

    i = 0;

    while(0 != *(pucChar + i))
    {
        DEV_PutChar(*(pucChar + i));
        i++;
    }
}

/***********************************************************************************
函数功能: 设置各个GPIO的工作模式.
入口参数: none.
返 回 值: none.
***********************************************************************************/
void DEV_SetGpioMode(void)
{
    GP1CON = 0x00000011;    /* P1.0和P1.1设置为串口 */
}

